In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
df.describe(include='object')

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

In [6]:
df.count()
df['age'].count() # 나이 정보의 총합 출력

np.int64(714)

In [7]:
df['age'].mean()

np.float64(29.69911764705882)

In [8]:
# 데이터 프레임 자체의 평균도 계산 가능 >> 근데 문자열 있는 경우 numeric_only 옵션 붙이면 >> 숫자만 골라서 평균 계산 가능
df.mean(numeric_only=True)

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [13]:
# 성인 남성의 요금 평균 구하기

cond = df['adult_male'] == True
df.loc[cond, 'fare'].mean() # 조건 필터링한 데이터 중, fare 컬럼만 선택 >> 이후 평균 계산

np.float64(24.864181750465548)

In [21]:
# 요금 30-40 지불한 승객 중 1등석인 사람의 나이 평균

cond1 = df['fare'] >= 30
cond2 = df['fare'] <= 40
cond3 = df['pclass'] == 1

df.loc[cond1 & cond2 & cond3, 'age'].mean() # 조건 필터링한 데이터 중, age 컬럼만 선탥 >> 이후 평균 계산

# numberic_only(skipna = False) 하면 na 들어 있는 경우는 계산 않는 것

np.float64(44.095238095238095)

In [23]:
numbers = [1,2,10,100,1000]
pd.Series(numbers).median()

np.float64(10.0)

In [27]:
mean_value = df['age'].mean()
median_value = df['age'].median()
print(mean_value, median_vale)

29.69911764705882 28.0

In [30]:
df.sum(numeric_only=True)

# 각 컬럼에 개별 접근 가능
df['fare'].sum()

np.float64(28693.9493)

In [32]:
df['fare'].cumsum() # 누적합
df['age'].cumprod()

C:\Users\1-08\Desktop\DAMF2\pandas\venv\Lib\site-packages\numpy\_core\fromnumeric.py:57: RuntimeWarning: overflow encountered in accumulate
  return bound(*args, **kwds)

0            22.0
1           836.0
2         21736.0
3        760760.0
4      26626600.0
          ...
886           inf
887           inf
888           NaN
889           inf
890           inf
Name: age, Length: 891, dtype: float64

In [34]:
fare_mean = df['fare'].mean()
fare_mean

np.float64(32.204207968574636)

In [39]:
# 편차 구하기 >> 편차 제곱합 구하기

# 분산 직접 해보기
total = ((df['fare'] - fare_mean) ** 2).sum()
total_count = df['fare'].count()

my_var = total / total_count
my_var

# 분산 함수 이용하기
df['fare'].var()

np.float64(2469.436845743116)

In [42]:
import numpy as np
np.sqrt(df['fare'].var())

np.float64(49.6934285971809)

In [43]:
df['fare'].std()

np.float64(49.6934285971809)

In [45]:
df['age'].max()

np.float64(80.0)

In [60]:
df['age'].agg(['max', 'min', 'count'])

max       80.00
min        0.42
count    714.00
Name: age, dtype: float64

In [62]:
#df['age', 'fare'].agg(['max', 'min'])
df[['age', 'fare']].agg(['max', 'min'])

       age      fare
max  80.00  512.3292
min   0.42    0.0000

In [51]:
df['age'].quantile(0.1) # 나이 기준 하위 10% 찾기

# 나이 기준 상위 20%
# df['age'].quantile(0.8)

np.float64(14.0)

In [53]:
df['who'].nunique()

3

In [56]:
df['deck'].mode()

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [57]:
df.corr(numeric_only=True)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [58]:
df.corr(numeric_only=True)['survived']

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male   -0.557080
alone        -0.203367
Name: survived, dtype: float64